kasanari/pes-visualizer-equalizer/skeleton-stm3220g/Utilities/STM32_Audio/STM324x7I_EVAL/stm324x7i_clk_synthesizer_cs2200.c
/**
  ******************************************************************************
  * @file    stm324x7i_clk_synthesizer_cs2200.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    14-January-2013
  * @brief   This file includes the external clock synthesizer controller.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm324x7i_clk_synthesizer_cs2200.h"
#include "stm32_audio_correction.h"

#if (AUDIO_SYNCHRO_CLKSYNTH_ENABLED == 1)
/** @addtogroup Audio_Utilities
* @{
*/

/** @defgroup CLK_SYNTHESIZER_CS2200
* @brief    This file includes the audio correction functional layer
* @{
*/ 

/** @defgroup CLK_SYNTHESIZER_CS2200_Private_TypesDefinitions
* @{
*/ 
/**
* @}
*/ 


/** @defgroup CLK_SYNTHESIZER_CS2200_Private_Defines
* @{
*/ 
/**
* @}
*/ 


/** @defgroup CLK_SYNTHESIZER_CS2200_Private_Macros
* @{
*/ 
/**
* @}
*/ 


/** @defgroup CLK_SYNTHESIZER_CS2200_Private_Variables
* @{
*/

uint32_t InputFreq     = 12000000; 
uint32_t OutputFreq    = 48000;
uint32_t Ratio         = 1;
uint32_t InitialRatio  = 1; 
static uint32_t ExtClkState  = STATE_NOTINITED;

DMA_InitTypeDef DMA_InitStructure;

extern SynchStruct_TypeDef SYNCH_EXTCLK_SynchStruct;

/* I2C Send/Receive Buffers */
uint32_t TxBuffer[CLK_SYNTH_I2C_MAX_SIZE];
uint32_t RxBuffer[CLK_SYNTH_I2C_MAX_SIZE];

/**
* @}
*/

/** @defgroup CLK_SYNTHESIZER_CS2200_Private_Constants
* @{
*/ 

/**
* @}
*/

/** @defgroup CLK_SYNTHESIZER_CS2200_Private_FunctionPrototypes
* @{
*/

/* Configuration functions */
static void    CLK_SYNTH_GPIO_Init            (void);
static void    CLK_SYNTH_GPIO_DeInit          (void);
static void    CLK_SYNTH_CtrlInterface_Init   (void);
static void    CLK_SYNTH_CtrlInterface_DeInit (void);
static void    CLK_SYNTH_RefClk_Init          (uint32_t Freq);
static void    CLK_SYNTH_RefClk_DeInit        (void);

/* Control port access functions */
static uint8_t CLK_SYNTH_WriteReg  (uint8_t Reg, uint8_t Value);
static uint8_t CLK_SYNTH_WriteBuff (uint8_t* pBuf, uint32_t Size);
static void    CLK_SYNTH_DMAConfig (void);

#ifdef VERIFY_WRITTENDATA
static uint8_t CLK_SYNTH_ReadReg   (uint8_t Reg);
#endif /* VERIFY_WRITTENDATA */

/**
* @}
*/ 


/** @defgroup CLK_SYNTHESIZER_CS2200_Private_Functions
* @{
*/ 

/**
  * @brief  CLK_SYNTH_Init 
  *         Initialize the external clock interfaces.
  * @param  OutFreq: Target output frequency in Hz
  * @param  InFreq: Input frequency in Hz (In this driver input frequency is fixed to 
  *         the value defined by I2S_EXT_REF_CLK in stm324x7i_clk_synthesizer_cs2200.h)
  * @param  InitCtrlPort: State of the control port. Can be 0: control port
  *         not initialized, or !0 meaning control port already initialized.
  * @param  Opt: optional parameter. Not used for this driver.
  * @retval 0 if passed. !0 if error occured during operation.
  */
uint32_t CLK_SYNTH_Init(uint32_t OutFreq, uint32_t InFreq, uint32_t InitCtrlPort, uint32_t Opt)
{ 
  uint32_t result = 0;

  /* Check if the component is already intialized */
  if (ExtClkState == STATE_INITED)
  {
    /* No initialization needed */
    return 0;
  }

  /* Configure the reference clock (from STM32 MCO output clock) */
  CLK_SYNTH_RefClk_Init(I2S_EXT_REF_CLK/*InFreq*/);
  
  /* Check if the control port is already initialized */
  if (InitCtrlPort == 0)
  {
    /* Initialize the control lines */ 
    CLK_SYNTH_GPIO_Init();
    
    /* Initialize the control port */
    CLK_SYNTH_CtrlInterface_Init();
  }
  
  /* Configure the DMA for the control port operations (I2C) */
  CLK_SYNTH_DMAConfig();
  
  /* Get the ratio to be programmed */
  InputFreq = InFreq;
  OutputFreq = OutFreq; 
  
  /* Check which frequency group should be configured (48KHz group and 44.1 group are not compatible) */
  if (OutFreq == (12288000 * 4))
  {
    /* Ratio calculated for Reference clock input = 40MHz  and Output frequency = 12.288MHz */
    Ratio = DEFAULT_RATIO_12_288 + SYNCH_EXTCLK_SynchStruct.pSynchOpt[0]; 
  }
  else if (OutFreq == (11289600 * 4))
  {
    /* Ratio calculated for Reference clock input = 40MHz  and Output frequency = 11.2896MHz */
    Ratio = DEFAULT_RATIO_11_2896 + SYNCH_EXTCLK_SynchStruct.pSynchOpt[0]; 
  }
  
  /* Keep the initial value of the Ratio for future modifications */
  InitialRatio = Ratio;
  
  /* Freeze the configuration */
  result += CLK_SYNTH_WriteReg(CS_GLOBAL_CFG, 0x08); 
  
  /* Auxilary output disabled */
  result += CLK_SYNTH_WriteReg(CS_DEVICE_CTRL, 0x02);
  
  /* No division on Ratio */
  result += CLK_SYNTH_WriteReg(CS_DEVICE_CFG1, 0x00);
  
#ifdef USE_I2C_DMA_TC_IT
  /* Write the Ratio bytes */
  result += CLK_SYNTH_WriteReg(CS_RATIO_3, (uint8_t)(((Ratio & 0xFF000000) >> 24)));
  result += CLK_SYNTH_WriteReg(CS_RATIO_2, (uint8_t)(((Ratio & 0xFF0000) >> 16)));
  result += CLK_SYNTH_WriteReg(CS_RATIO_1, (uint8_t)(((Ratio & 0xFF00)>> 8)));
  result += CLK_SYNTH_WriteReg(CS_RATIO_0, (uint8_t)(Ratio & 0xFF));
#else   
  *(uint8_t*)((uint8_t*)TxBuffer) = (CS_RATIO_3 | 0x80);
  *(uint8_t*)((uint8_t*)TxBuffer + 1) = (uint8_t)(((Ratio & 0xFF000000) >> 24));
  *(uint8_t*)((uint8_t*)TxBuffer + 2) = (uint8_t)(((Ratio & 0xFF0000) >> 16));
  *(uint8_t*)((uint8_t*)TxBuffer + 3) = (uint8_t)(((Ratio & 0xFF00)>> 8));
  *(uint8_t*)((uint8_t*)TxBuffer + 4) = (uint8_t)(Ratio & 0xFF);
  CLK_SYNTH_WriteBuff((uint8_t *)TxBuffer, 5);
#endif /* USE_I2C_DMA_TC_IT */
  
