kasanari/pes-visualizer-equalizer/skeleton-stm3220g/Utilities/STM32_Audio/STM324x7I_EVAL/stm324x7i_clk_synthesizer_cs2200.c
  /* Reference clock input divider set to 2 (input = 24 MHz) */
  result += CLK_SYNTH_WriteReg(CS_FUNCT_CFG1, 0x08);
  
  /* Unfreeze: start clocking */
  result += CLK_SYNTH_WriteReg(CS_GLOBAL_CFG, 0x01);
  
  /* Check if the injected error is not 0 */
  if (SYNCH_EXTCLK_SynchStruct.pSynchOpt[0])
  {
    /* Update the correction period and step (more than 100ppm error is injected) */
    SYNCH_EXTCLK_SynchStruct.SynchPeriod = SYNCH_EXTCLK_SynchStruct.pSynchOpt[1];
    SYNCH_EXTCLK_SynchStruct.SynchStep = SYNCH_EXTCLK_SynchStruct.pSynchOpt[2];
  }
  
  return result;
}

/**
  * @brief  CLK_SYNTH_DeInit 
  *         Free all resources used by audio correction mechanism.
  * @param  speed : device speed
  * @retval 0 if passed. !0 if error occured during operation.
  */
uint32_t CLK_SYNTH_DeInit(void)
{
  /* Check if the component is already deinitialized */
  if (ExtClkState == STATE_NOTINITED)
  {/* No need for deinitialization */
    return 0;
  }

  /* Free used IOs */
  CLK_SYNTH_GPIO_DeInit();

  /* Free the control port */
  CLK_SYNTH_CtrlInterface_DeInit();
  
  /* Free the reference clock source */
  CLK_SYNTH_RefClk_DeInit();
  
  /* Reset state to not initialized */
  ExtClkState = STATE_NOTINITED;  
  
  return 0;
}

/**
  * @brief  CLK_SYNTH_AdjustPpm
  *         Update the current output frequency with ppm step.
  * @param  Ppm: Number of ppm to be increased or decreased.
  * @param  Direction: Direction of the update. EXTCLK_DIR_UP to 
  *         increase the frequency or EXTCLK_DIR_DOWN to decrease 
  *         the frequency.
  * @retval 0 if passed. !0 if error occured during operation.
  */
uint32_t CLK_SYNTH_AdjustPpm(uint32_t Ppm, uint32_t Direction)
{ 
  uint32_t result = 0;
  
  /* Check the update direction */
  if (Direction == EXTCLK_DIR_UP)
  {
    /* Increase the output frequency */
    Ratio += (Ratio * Ppm) / 1000000;
  }
  else /* if (Direction == EXTCLK_DIR_DOWN) */
  {
    /* Decrease the output frequency */
    Ratio -= (Ratio * Ppm) / 1000000;
  } 
  
  *(uint8_t*)((uint8_t*)TxBuffer) = (CS_RATIO_3 | 0x80);
  *(uint8_t*)((uint8_t*)TxBuffer + 1) = (uint8_t)(((Ratio & 0xFF000000) >> 24));
  *(uint8_t*)((uint8_t*)TxBuffer + 2) = (uint8_t)(((Ratio & 0xFF0000) >> 16));
  *(uint8_t*)((uint8_t*)TxBuffer + 3) = (uint8_t)(((Ratio & 0xFF00)>> 8));
  *(uint8_t*)((uint8_t*)TxBuffer + 4) = (uint8_t)(Ratio & 0xFF);
  CLK_SYNTH_WriteBuff((uint8_t *)TxBuffer, 5);
  
  return result;
}

/** @brief  CLK_SYNTH_UpdateFreq
  *         Update the current output frequency with new frequency.
  * @param  Freq: New frequency to be configured.
  * @param  opt1: optional parameter. Not used for this driver.
  * @param  opt2: optional parameter. Not used for this driver.
  * @param  opt3: optional parameter. Not used for this driver.
  * @retval 0 if passed. !0 if error occured during operation.
  */
uint32_t CLK_SYNTH_UpdateFreq(uint32_t Freq, uint32_t opt1, uint32_t opt2, uint32_t opt3)
{ 
  uint32_t result = 0;
  
  /* Get the ratio to be programmed */
  OutputFreq = Freq; 
  
  /* Check which frequency group should be configured (48KHz group and 44.1 group are not compatible) */
  if (OutputFreq == (12288000 * 4))
  {
    /* Ratio calculated for Reference clock input = 40MHz  and Output frequency = 12.288MHz */
    Ratio = DEFAULT_RATIO_12_288 + SYNCH_EXTCLK_SynchStruct.pSynchOpt[0]; 
  }
  else if (OutputFreq == (11289600 * 4))
  {
    /* Ratio calculated for Reference clock input = 40MHz  and Output frequency = 11.2896MHz */
    Ratio = DEFAULT_RATIO_11_2896 + SYNCH_EXTCLK_SynchStruct.pSynchOpt[0]; 
  }
  else if (OutputFreq == (11264000 * 4))
  {
    /* Ratio calculated for Reference clock input = 40MHz  and Output frequency = 11.2896MHz */
    Ratio = DEFAULT_RATIO_11_264 + SYNCH_EXTCLK_SynchStruct.pSynchOpt[0];     
  }
  
  /* Update the initial value of the Ratio for future modifications */
  InitialRatio = Ratio;

  /* Update the ratio value in sequence write */
  *(uint8_t*)((uint8_t*)TxBuffer) = (CS_RATIO_3 | 0x80);
  *(uint8_t*)((uint8_t*)TxBuffer + 1) = (uint8_t)(((Ratio & 0xFF000000) >> 24));
  *(uint8_t*)((uint8_t*)TxBuffer + 2) = (uint8_t)(((Ratio & 0xFF0000) >> 16));
  *(uint8_t*)((uint8_t*)TxBuffer + 3) = (uint8_t)(((Ratio & 0xFF00)>> 8));
  *(uint8_t*)((uint8_t*)TxBuffer + 4) = (uint8_t)(Ratio & 0xFF);
  CLK_SYNTH_WriteBuff((uint8_t *)TxBuffer, 5);
  
  return result;
}


/**
  * @brief  CLK_SYNTH_WriteReg
  *         Writes a value to a register.
  * @param  Reg: register address to be written.
  * @param  Value: value to be written to the reigster.
  * @retval 0 if passed. !0 if error occured during operation.
  */
uint8_t CLK_SYNTH_WriteReg(uint8_t Reg, uint8_t Value)
{
  uint32_t result = 0;
  uint32_t Timeout = 0;
  
  /* Disable the interrupts mechanism to prevent the I2C communication from corruption */
  __disable_irq();

  /*!< While the bus is busy */
  Timeout = CLK_SYNTH_LONG_TIMEOUT;
  while(I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BUSY))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Start the config sequence */
  I2C_GenerateSTART(CLK_SYNTH_I2C, ENABLE);

  /* Test on EV5 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(CLK_SYNTH_I2C, CLK_SYNTH_ADDRESS, I2C_Direction_Transmitter);

  /* Test on EV6 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }

  /* Transmit the first address for write operation */
  I2C_SendData(CLK_SYNTH_I2C, Reg);

  /* Test on EV8 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Prepare the register value to be sent */
  I2C_SendData(CLK_SYNTH_I2C, Value);
  
  /*!< Wait till all data have been physically transferred on the bus */
  Timeout = CLK_SYNTH_LONG_TIMEOUT;
  while(!I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BTF))
  {
    if((Timeout--) == 0) CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* End the configuration sequence */
  I2C_GenerateSTOP(CLK_SYNTH_I2C, ENABLE);  
  
#ifdef VERIFY_WRITTENDATA
  /* Verify that the data has been correctly written */  
  result = (ReadRegister(RegisterAddr) == RegisterValue)? 0:1;
#endif /* VERIFY_WRITTENDATA */
  
